Revit 2024 API
FabricationPartSizeMap.IsProductList Property
 Are the sizes for a product listed fabrication part.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.2
Syntax
C#
public bool IsProductList { get; set; }
Visual Basic
Public Property IsProductList As Boolean
	Get
	Set
Visual C++
public:
property bool IsProductList {
	bool get ();
	void set (bool value);
}
See Also
FabricationPartSizeMap Class
Autodesk.Revit.DB.Fabrication Namespace